first_app/app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    unless current_user.teacher?
      @post.group_id = current_user.group_id
    else
      @post.subject = current_user.subject
    end

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "A zuera never terminas"], ["created_at", "2014-05-14 14:36:25.240562"], ["updated_at", "2014-05-14 14:36:25.240562"], ["user_id", 1]]