first_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-07 15:28:31.880076"], ["email", "chico@exemplo.ort"], ["name", "chico"], ["updated_at", "2014-05-07 15:28:31.880076"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["name", "Miguel Corti"], ["password_digest", "$2a$10$/BSgEqD9rJpQDo4LEK76HeduSrXeUL3n2.PgIpdczRavF87dORIU6"], ["updated_at", "2014-06-25 22:00:05.604013"]]
---
  def update
    if @user.update_attributes(user_params)