first_app/app/views/users/show.html.erb

  <div class="span8">
    <% if @user.microposts.any? %>
---
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 1]]